# DataFrame

In [42]:
import numpy as np
import pandas as pd

In [43]:
data = {"apples ":[2,3,4,5,6],
        "Oranges":[10,20,30,5,34]
       }

In [44]:
purchases = pd.DataFrame(data, index = ['Mon', 'Tue', 'Wed', 'Thur', 'Fri'])
purchases

      apples   Oranges
Mon         2       10
Tue         3       20
Wed         4       30
Thur        5        5
Fri         6       34

In [45]:
dt = {
    "Charles":['I like It.', 'It was very terrible'],
    "Mutua":['Good.', 'Could do bettwer']   
}

reviews = pd.DataFrame(dt)
reviews

                Charles             Mutua
0            I like It.             Good.
1  It was very terrible  Could do bettwer

In [46]:
# How to Assign Labels for ourselves in a DataFrame
reviews = pd.DataFrame(dt, index = ['Product A', 'Product B'])
reviews

                        Charles             Mutua
Product A            I like It.             Good.
Product B  It was very terrible  Could do bettwer

In [47]:
# Create a DataFrame of 7 students Records, include the names, DOB and Gender: MF


stud_details = {
    "names":['Charles', 'Brian', 'Collo', 'Susan','Steph','Ken', 'Dennis'],
    "dob":['1959', '1960', '1976', '1977', '1991', '1990', '1993'],
    "gender":['M', 'M', 'M','F', 'F','M','M']
    }

details = pd.DataFrame(stud_details, index = ['1','2','3','4', '5', '6', '7'])
details[2]

     names   dob gender
1  Charles  1959      M
2    Brian  1960      M
3    Collo  1976      M
4    Susan  1977      F
5    Steph  1991      F
6      Ken  1990      M
7   Dennis  1993      M

In [48]:
# How can you get a single Column?

new_details = details['names']
new_details

1    Charles
2      Brian
3      Collo
4      Susan
5      Steph
6        Ken
7     Dennis
Name: names, dtype: object

In [49]:
# Filter Columns

new_details2 = details[['names', 'dob']]
new_details2

     names   dob
1  Charles  1959
2    Brian  1960
3    Collo  1976
4    Susan  1977
5    Steph  1991
6      Ken  1990
7   Dennis  1993

# SERIES
A series is essentially a column

In [50]:
s = pd.Series([1,3,4,5,8])
s

0    1
1    3
2    4
3    5
4    8
dtype: int64

In [51]:
# Creating a series with Custom Labels and Overall name

prod_A = pd.Series([1000, 3000, 15000], index = ['2019 Sales', '2018 Sales', '2017 Sales'], name = 'Product A')
prod_A

2019 Sales     1000
2018 Sales     3000
2017 Sales    15000
Name: Product A, dtype: int64

In [52]:
# Grads since 2010-2015
#200, 400,800,560,120

grads = pd.Series([200,400,800,560,120], index = [ 2011, 2012, 2013,2014,2015], name = "College X Grads")
grads

2011    200
2012    400
2013    800
2014    560
2015    120
Name: College X Grads, dtype: int64

### CREATE A SERIES FROMA NUMPY ARRAY

In [54]:
letters = np.array(['a', 'b', 'c', 'd'])
ser = pd.Series(letters, name = 'some letters')
ser

0    a
1    b
2    c
3    d
Name: some letters, dtype: object

##### Accessing Elements of a series
Using Position, index/label

In [59]:
data = np.array(['a', 'b', 'c', 'd'])
series = pd.Series(data)
series[1]

'b'